IDEA StatiCa Open Model
ReinfBarOnEdge.ExtendDistanceEnd Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Distance of extension of end
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double ExtendDistanceEnd { get; set; }
Public Property ExtendDistanceEnd As Double
	Get
	Set
public:
property double ExtendDistanceEnd {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
ReinfBarOnEdge Class
IdeaRS.OpenModel.Detail Namespace